{
  "drinke":{
    "title":"Drinke: The Hydration Tracking Smartcup",
    "thumb":{
      "type":"tangible",
      "src":"",
      "alt":"Drinke",
      "title":"Drinke Smartcup"
    },
    "date":"Best Project, Interactive Device Design, Fall 2012",
    "keywords":"Arduino, xbee, jQuery Mobile, Node.js, Django, Solid Works, PCB, Rapid Prototyping",
    "class":"Interactive Device Design",
    "site":[
      {
        "title":"Drinke Business Plan PDF",
        "src":"images/smartcup/Drinkebusinessplan_rev2.pdf"
      }
    ],
    "team":[
      {
        "name":"Amy Pavel"
      },
      {
        "name":"Sean Chen"
      },
      {
        "name":"Steve Rubin"
      }
    ],
    "text":[
      {
        "p":"Drinke is a smartcup which aims to improve the hydration habits of users by tracking what and how much they drink while providing in-depth analytics and goal-tracking. It does so by automatically detecting what beverage is in the cup and how much. In this way, the user needs to exert very little effort to track their hydration, caffeine intake, and sugar intake. "
      },
      {
        "p":"Drinke is inspired by the Quantified Self trend and we sought to create a tool to help aid the user track their beverage consumption. More personally, all four of us find that we tend to forget to drink when deep in the coding mindset. "
      },
      {
        "p":"Although mobile apps to track hydration are in abundance, they rely heavily on the user to manually enter their data. We felt this was a major pain-point and too prone to error and an incomplete dataset. Instead of relying solely on the user, we created a device to automatically detect the beverage type and volume and upload it to a server. A companion webapp can then display the user&#39;s consumption data and allow them to set alerts and goals with regards to specific drink types."
      },
      {
        "p":"To determine drink types, we developed an elegant, cheap solution: using a photoresistor and RGB LED to develop a profile for each drink type. The LED cycles through different colors; we found that Red, Green, Blue, and White were sufficient, though of course more channels does provide a bit more accuracy. The different beverage types transmit differing amounts of light based on the color and a unique classification profile is made for each drink. These profiles are fed into a SciPy learning algorithm which can then compare the current drink state to its database and return the best match. "
      },
      {
        "p":"We also included a temperature sensor for an additional datapoint. Hot and dark would probably be coffee; cold and dark, a cola. A force sensor on the bottom of the cup provides the weight of the cup from which we calculate the volume of the liquid in the cup. A LCD screen can display data directly on the cup providing feedback to the user without them having to pull out their smartphone. An xbee embedded in the bottom of the cup transmits the data to a node.js server. The whole cup is controlled by an Arduino Mini"
      },
      {
        "p":"The cup itself is a 3D printed prototype, designed in Solidworks. It is comprised of a transparent inner cup which holds the beverage and an outer opaque shell. The base is detachable and holds all the electronics. We created a top to provide a more stable environment for our light readings, though in theory one could calibrate the readings to account for the ambient environment. In order to perform initial tests of our light classification system, we used a clear plastic, cup. After ensuring our hypothesis was correct, we then moved on to creating our custom cup. "
      },
      {
        "p":"The light readings plus learning algorithm worked amazingly well. Although we cannot tell the difference between a Coke and Pepsi, we can certainly tell the difference between a cola, tea, and coffee. That said, brewed drinks can be a bit difficult as individual preference can lead to quite different levels of brewing. Sometimes a peppermint tea can look like an apple juice, for instance. In the end, the user will have to initially train the cup and develop a profile for each drink. In this way, the cup will learn how dark the user typically brews their drinks."
      },
      {
        "p":"If there is ambiguity, we thought that the user could clarify them directly on the cup through the LCD screen and a couple buttons. This initial prototype did not include these buttons however for time and cost considerations in reprinting the cup."
      },
      {
        "p":"The companion webapp is built off of jQuery Mobile. It provides the user with the ability to set goals and limits for each beverage type. It also provides overview and consumption history graphs, implemented in d3. The data for the webapp is served from a Django server."
      }
    ],
    "images":[
      {
        "src":"images/smartcup/drinke.jpg",
        "caption":"Drinke: The 3D Printed Smartcup"
      },
      {
        "src":"images/smartcup/drinke_poster.jpg",
        "caption":"Presentation poster showing cup construction and componenets, drink types and process, and mobile app screenshots."
      },
      {
        "src":"images/smartcup/home_goals.png",
        "caption":"Screenshots of the webapp Homescreen and Goals page"
      },
      {
        "src":"images/smartcup/overview.png",
        "caption":"Screenshots of the webapp Overview pages. The bullet chart is done in d3 and shows current consumption compared to the user set goals and limits"
      },
      {
        "src":"images/smartcup/history.png",
        "caption":"Screenshots of the webapp Consumption History pages. The chart is done in d3"
      },
      {
        "src":"images/smartcup/concept_1.jpg",
        "caption":"My Initial Concept Sketches"
      },
      {
        "src":"images/smartcup/concept_2.jpg",
        "caption":"More Initial Concept Sketches"
      },
      {
        "src":"images/smartcup/initial_light_test.jpg",
        "caption":"Initial light test setup"
      },
      {
        "src":"images/smartcup/lcd_temp.jpg",
        "caption":"Testing the temperature sensor and LCD screen"
      },
      {
        "src":"images/smartcup/cup.jpg",
        "caption":"3D printed cup, fresh out of the oven"
      },
      {
        "src":"images/smartcup/electronics.jpg",
        "caption":"Photo showing the bottom of the cup with all the electronics. The arduino is being programmed in this image."
      },
      {
        "src":"images/smartcup/base.jpg",
        "caption":"Photo of the base of the cup with the LiPo battery and charger. You can also see the mounts for the Arduino/PCB."
      },
      {
        "src":"images/smartcup/sensor_chart.png",
        "caption":"Chart showing the light readings for different drink types"
      },
      {
        "src":"images/smartcup/team.jpg",
        "caption":"Team photo after winning the Best Project award"
      }
    ],
    "video":[
      {
        "src":"images/smartcup/drinks.mp4",
        "caption":"Video showing drinks being added to the smartcup and the webapp updating in response."
      },
      {
        "src":"images/smartcup/drinke_leds.mp4",
        "caption":"Video showing the smartcup LEDs cycling through their colors, water being added to the cup, and the webapp updating."
      }
    ]
  },
  "graffiti":{
    "title":"Phauffiti: A Mobile Geocoded 3d Street Art Platform",
    "thumb":{
      "type":"apps",
      "src":"",
      "alt":"Phauffiti",
      "title":"Phauffiti"
    },
    "date":"3rd Place, Designing Mobile Experiences, Fall 2012",
    "keywords":"Mobile Design, Axure, User Research",
    "class":"Designing Mobile Experiences",
    "site":[
      {
        "title":"Axure prototype",
        "src":"portfolio/Graffiti_jen/graffiti.html"
      },
      {
        "title":"Final Presentation",
        "src":"https://docs.google.com/presentation/d/1kyb2g3JFnvs9i68-WGZfYR57PE1KYGQom4CFqMxUEUE/edit"
      }
    ],
    "team":[
      {
        "name":"Jennifer Wang",
        "site":"http://dominantprimordialbeast.com/"
      },
      {
        "name":"Sam Tolkheim"
      }
    ],
    "text":[
      {
        "p":"Phauffiti is a mobile app which re-envisions how we interact with our mobile devices. It augments reality to extend the physical world into digital space, providing a medium for the anonymous creation and display of art, statements, and self-expressions, which fosters interaction between the user community."
      },
      {
        "p":"Basically, it is the cowards-yuppies-hipsters graffiti medium."
      },
      {
        "p":"Unlike other drawing apps for which you use your finger on the touch screen, Phauffiti makes use of the affordances of the phone to recreate the experience of drawing with a spray-paint can while making use of the affordances of digital space to allow the user to draw in 3d, rather than being tied to a flat surface. By combining GPS and accelerometer data, Phauffiti detects the paths of a user swinging their phone about in space and create a 3d object situated in a particular location."
      },
      {
        "p":"Part of the fun of street art is discovering hidden gems which have become an intricate part of the urban fabric. Instead of divorcing the Phauffiti art from its environment, users must visit the location in order to view the art. It&#39;s an artistic way for people to engage in the community. Teaser thumbnails are displayed in a gallery and on a map so the user can located art which intrigues them. "
      },
      {
        "p":[
          {"span":"As part of our user research, we identified two user groups: "},
          {
            "ul":[
              {"li":"ARTISTS: Those who will interact with physical environments by using the tool to customize them virtually."},
              {"li":"ACTIVISTS: Those who will use the tool to express free speech. "}
            ]
          }
        ]
      },
      {
        "p":"During our user research, we discovered two important facets to Phauffiti. First, street art is anonymous, and often an anonymous form of communication between artists who may not know each other except by their work. Phauffiti will support these concerns by allowing artists to publish completely anonymously or with a handle. An anonymous handle allows users to follow each other and their work, but divorces the user&#39;s true identity from their work. "
      },
      {
        "p":"A second discovery is that street art is ephemeral. Part of the appeal, and what sets it apart from gallery art, is that it decays with the environment and can disappear completely. Phauffiti art will too, be ephemeral, with decay algorithms built in. "
      }
    ],
    "images":[
      {
        "src":"images/graffiti/jen_storyboard.jpg",
        "caption":"Jennifer&#39;s storyboard demonstrating the draw section of Phauffiti"
      },
      {
        "src":"images/graffiti/deviceecosystem-01.png",
        "caption":"Phauffiti device ecosystem showing that phones can be used to draw and view art, but tablets can be used to view only."
      },
      {
        "src":"images/graffiti/phauffiti_wire.png",
        "caption":"Wireframes of all the screens which explores the interactions, layout, and App map"
      },
      {
        "src":"images/graffiti/app_map_med.jpg",
        "caption":"App Map showing every screen and their links. There are two main sections, Viewing Art and Drawing Art."
      },
      {
        "src":"images/graffiti/splash_screen.jpg",
        "caption":"Mockup Splashscreen"
      },
      {
        "src":"images/graffiti/Near_you2_sm.jpg",
        "caption":"Mockup Gallery showing art nearby"
      },
      {
        "src":"images/graffiti/Map2_sm.jpg",
        "caption":"Mockup Map"
      },
      {
        "src":"images/graffiti/Finding_art_sm.jpg",
        "caption":"Mockup Viewer showing art in a specific location"
      },
      {
        "src":"images/graffiti/Start_draw_sm.jpg",
        "caption":"Mockup Draw screen"
      },
      {
        "src":"images/graffiti/Color_Select_sm.jpg",
        "caption":"Mockup Color Selection screen"
      },
      {
        "src":"images/graffiti/Brush_select_sm.jpg",
        "caption":"Mockup Brush Selection screen"
      },
      {
        "src":"images/graffiti/Check_Art_Made_sm.jpg",
        "caption":"Mockup Draw screen with art"
      },
      {
        "src":"images/graffiti/Brag_sm.jpg",
        "caption":"Mockup Metadata screen"
      },
      {
        "src":"images/graffiti/affinity_diagram.jpg",
        "caption":"Affinity Diagram"
      }
    ]
  },
  "pap":{
    "title":"Pole Aerial Photography Rig",
    "thumb":{
      "type":"tangible",
      "src":"images/pap_thumb.jpg",
      "alt":"PAP",
      "title":"Pole Aerial Photography"
    },
    "date":"Summer 2010",
    "keywords":"Arduino, xbee",
    "text":[
      {
        "p":"I am a tinkerer. I am also a photographer. This is a personal project which combines both."
      },
      {
        "p":[
          {"span":"Inspired by my former professor, "},
          {
            "a":{
              "src":"http://www.flickr.com/people/kap_cris/",
              "text":"Cris Benton"
            }
          },
          {"span":", I wanted to get into aerial photography for some time. Unfortunately, kite aerial photography has a high barrier for entry for someone who has never flown a kite. But pole aerial photography seemed much easier."}
        ]
      },
      {
        "p":"I bought a 9.5 meter long carbon fiber margin pole, typically used for fishing in the UK. I then built a rig to attach my camera and designed a device to remotely fire the shutter."
      },
      {
        "p":"To fire the camera, I have two parts: one on the ground and one on the camera. Attached to the camera is an Arduino mini, connected to an xbee radio transmitter and a servo motor which physically presses the camera shutter button. On the ground is a remote with a button connected to another xbee radio transmitter. When the button is pressed, the signal is transmitted to the Arduino which then actuates the server. An LED indicates the signal was sent."
      },
      {
        "p":"For the remote, I reused an old case my former lab was throwing out. Not shown are they batteries which I could not fit inside. Instead, I mounted them on the back which actually provided a decent grip on an object that was otherwise slightly too big for my hands."
      },
      {
        "p":"After my first use, I immediately realized I had forgotten one very important feature...a belt clip, luckily, an easy to add feature."
      },
      {
        "p":"My current goal for the Spring of 2013 is to make use of my access to the CITRIS Innovation Lab and 3d print some custom cases and design/mill a PCB board."
      }
    ],
    "images":[
      {
        "src":"images/pap_all.jpg",
        "caption":"Pole with rig and camera"
      },
      {
        "src":"images/pap_rig.jpg",
        "caption":"Pole Rig"
      },
      {
        "src":"images/pap_arduino.jpg",
        "caption":"Arduino connected to a servo motor and xbee"
      },
      {
        "src":"images/pap_camera.jpg",
        "caption":"Camera plus remote shutter"
      },
      {
        "src":"images/pap_remote.jpg",
        "caption":"Remote"
      },
      {
        "src":"images/pap_remote_open.jpg",
        "caption":"Remote innards"
      }
    ]
  },
  "xfit":{
    "title":"CrossMetRx: A CrossFit programming and tracking app",
    "thumb":{
      "type":"apps",
      "src":"images/xf_thumb.jpg",
      "alt":"CrossFit",
      "title":"CrossMetRx"
    },
    "date":"Spring 2012",
    "class":"UI Design and Development",
    "site":[
      {
        "title":"Final Website",
        "src":"http://www.crossmetrx.com/"
      },
      {
        "title":"Balsamiq Mockup",
        "src":"/portfolio/xf_balsamiq/login.html"
      }
    ],
    "team":[
      {
        "name":"Andrew Chao",
        "site":"http://www.acchao.com/"
      },
      {
        "name":"Gilbert Hernandez",
        "site":"http://thegilby.com/"
      },
      {
        "name":"Laura Wishingrad",
        "site":"http://laurawishingrad.com/"
      },
      {
        "name":"Taeil Kwak"
      }
    ],
    "keywords":"Javascript, jQuery, Django, d3.js, User Research, Rapid Prototyping",
    "text":[
      {
        "p":"CrossFit is a fitness routine which combines multiple other fitness styles. Some key aspects of CrossFit is that the workout routines change daily and there is a focus on tracking individual progress."
      },
      {
        "p":[
          {"span":"The goal of this project was to extend the CrossFit community such that coaches and members can have a better platform for interaction. In particular, we:"},
          {
            "ul":[
              {"li":"Created a tool for coaches to program workouts"},
              {"li":"Provided a simple way for members to record their performance"},
              {"li":"Displayed performance data in a compelling, visual way"}
            ]
          }
        ]
      },
      {
        "p":[
          {"span":"Once we had chosen these user groups, we have moved onto developing some rapid prototypes of three main features: "},
          {
            "ul":[
              {"li":"A web app to programming workouts for the coaches (which I have focused on)"},
              {"li":"A web app to view gym and user stats (for coaches and gym members)"},
              {"li":"A mobile app to log member's workout performance."}
            ]
          }
        ]
      },
      {
        "p":"We iterated through many designs moving from paper prototypes, balsamiq mock-ups, and finally, a fully functional html site. After each iteration, we conducted formative and heuristic evaluations on these prototypes with designers and with CrossFit coaches. "
      },
      {
        "p":"The website was built using a django backend and jQuery and jQuery UI frontend. The radar graoh visualizations were built using d3."
      }
    ],
    "images":[
      {
        "src":"images/xf_programming_page.png",
        "caption":"Website Programming Page"
      },
      {
        "src":"images/xf_vis.png",
        "caption":"d3 Radar Visualizations of Workouts"
      },
      {
        "src":"images/xf_front.png",
        "caption":"Website Front Page"
      },
      {
        "src":"images/xf_coach.png",
        "caption":"Website Coach Pannel Page"
      },
      {
        "src":"images/xf_sketch.jpg",
        "alt":"Brainstorming sketches",
        "caption":"Elliot's Brainstorming sketches of the Programming Page"
      },
      {
        "src":"images/xf_programming_prototype_v.jpg",
        "caption":"Illustrator Concept 1"
      },
      {
        "src":"images/xf_programming_prototype_h.jpg",
        "caption":"Illustrator Concept 2"
      },
      {
        "src":"images/xf_programming_bal.png",
        "caption":"Balsamiq Programming Mockup"
      },
      {
        "src":"images/xf_ProgrammingSequenceModel.png",
        "caption":"Programming Sequence model"
      },
      {
        "src":"images/xf_FlowModelCoach.png",
        "caption":"Coach Flow Model"
      }
    ]
  },
  "slopegraph":{
    "title":"Oregon Health Statistics Slopegraph",
    "thumb":{
      "type":"info_vis",
      "src":"",
      "alt":"Slopegraph",
      "title":"Slopegraph"
    },
    "date":"Summer 2012",
    "keywords":"Javascript, d3, Fusion Tables",
    "site":[
      {
        "title":"Code Repository",
        "src":"https://code.google.com/p/oregon-epht-demo/"
      },
      {
        "title":"Live Demo",
        "src":"http://www.elliotnahman.com/portfolio/oregon-epht-demo/slopegraph.html"
      }
    ],
    "text":[
      {
        "p":"While interning with the Fusion Table team at Google during the summer of 2012, my primary project was to work with the State of Oregon and convince them to host data with us. This project included a wide variety of skills: conducting user research on their needs and processes, discovering what types and formats their data came in, providing some initial training and use guides, and designing and creating various demonstration projects. I am very happy to say that it sounds like the project was quite successful and the State of Oregon is pursuing hosting data with Fusion Tables."
      },
      {
        "p":"This slopegraph is one visualization which I developed as part of that project. It pulls data at runtime from several Fusion Tables I created. The dataset I used contained a variety of health outcomes broken down by county and year. The slopegraph is a great way to represent this data as it allows the viewer to compare each county&#39;s performance to one another while simultaneously comparing a county&#39;s change from one dataset to another. The datasets on either side can compare data from different years or different disease sets. This allows the user to explore changes over time or the differing rates of diseases. "
      },
      {
        "p":"I connected a county with an increase in the disease rate from the left side to the right side green, and decrease blue. The state average is given in black. On hover over a particular county, all other counties fade, the text of that county gets bigger, and a pop-up opens showing the change across the two datasets. The state average remains solid for comparison. "
      }
    ],
    "images":[
      {
        "src":"images/slopegraph/slopegraph.jpg",
        "caption":"The basic slopegraph, comparing Male vs Female Asthama rates in 2007"
      },
      {
        "src":"images/slopegraph/slopegraph2.jpg",
        "caption":"Slopegraph hovering over a county"
      },
      {
        "src":"images/slopegraph/slopegraph3.jpg",
        "caption":"Slopegraph comparing two years"
      },
      {
        "src":"images/slopegraph/slopegraph4.jpg",
        "caption":"Slopegraph hovering over a county on the right side"
      }
    ]
  },
  "eplus":{
    "title":"Energy Plus Parametric Simulation Viewer",
    "thumb":{
      "type":"info_vis",
      "src":"images/eplus_thumb.jpg",
      "alt":"Energy Plus Simulation Viewer",
      "title":"Energy+ Sim Viewer"
    },
    "date":"Spring 2012",
    "keywords":"Information Visualization, d3.js, Javascript, jQuery, VBA",
    "site":[
      {
        "title":"Website Viewable Here",
        "src":"portfolio/eplus/eplusViewer.html"
      }
    ],
    "text":[
      {
        "p":[
          {"span":"In this class project for Info Vis, I created a viewer to analyze results from energy simulations I have been running as part of my Building Science Masters thesis. It uses the "},
          {
            "a":{
              "src":"http://mbostock.github.com/d3/",
              "text":"d3 "
            }
          },
          {"span":"javascript library to compare two simulations and generates a series of small multiples bar charts. "}
        ]
      },
      {
        "p":"The data shows EUI (energy by square-foot) data, broken down by end use and separated by representative cities. The cities themselves are arranged in a matrix on the page based on climate zone and climate type (see ASHRAE map). Blanks exist because there are no such climate zone-type combinations in the US."
      },
      {
        "p":"Hovering over the bars displays a pop-up showing total EUI, end use EUI,  and the percentage that end use represents."
      },
      {
        "p":"Although the graphs themselves are done, this is still a work in progress. I intend to provide key differences between the two chosen simulations which will appear as you select a simulation."
      },
      {
        "p":[
          {"span":"This is live and can be viewed "},
          {
            "a":{
              "src":"portfolio/eplus/eplusViewer.html",
              "text":"here. "
            }
          }
        ]
      }
    ],
    "images":[
      {
        "src":"images/eplus_graph.png",
        "alt":"small multiples",
        "caption":"A pair of small multiple with the on-hover feature"
      },
      {
        "src":"images/eplus_site.png",
        "alt":"",
        "caption":"Simulation Viewer Site"
      },
      {
        "src":"images/eplus_map.gif",
        "alt":"ASHRAE Climate Zone Map",
        "caption":"ASHRAE Climate Zone Map illustrating the climate zone-climate type relationship"
      }
    ]
  },
  "psychrometric":{
    "title":"Excel Psychrometric Chart",
    "thumb":{
      "type":"info_vis",
      "src":"images/excel_psych_thumb.jpg",
      "alt":"Excel Psychrometric Chart",
      "title":"Psychrometric Chart"
    },
    "date":"Summer 2010",
    "keywords":"VBA, Work Models",
    "text":[
      {
        "p":[
          {"span":"In this project, I created a "},
          {
            "a":{
              "src":"http://en.wikipedia.org/wiki/Psychrometrics",
              "text":"psychrometric chart "
            }
          },
          {"span":"in Excel. When studying the built environment, it is often useful to graph environmental data on one of these charts and contrast it to HVAC setpoints and industry defined thermal comfort zones. "}
        ]
      },
      {
        "p":"In my former lab, Center for the Built Environment (CBE), researchers would often plot data on psychrometric charts manually by drawing points with tools such as Adobe Illustrator or MS Powerpoint. Although software tools with psychrometric chart graphing capabilities do exist, they are tailored towards mechanical engineers and packaged with many expensive and overly complicated add-ons. What my lab needed was a cheap, straightforward, and easy to use option. "
      },
      {
        "p":"In response to this need for an intuitive and automatic psychrometric graphing tool, I decided to build one. Originally, I was going to use it as an opportunity to further my Processing skills. However, as I began to consider the problem in more depth, I realized Processing was a silly choice. In the end, I would end up with a pretty, but harder to use product&#x2014;one that interrupted the researchers' work flow. "
      },
      {
        "p":"The researchers at CBE are all well versed in Excel and use it for most of their data analysis and graphing. Rather than making the researchers export their data from Excel and into my Processing program, it made much more sense just to build a tool in Excel using VBA. This would allow for a more seamless flow from the researchers' data analysis, to visualizing their data."
      },
      {
        "p":[
          {"span":"The psychrometric chart allows the researcher to specify the chart ranges and increments for Temperature on the "},
          {"em":"x"},
          {"span":"-axis and Humidity Ratio on the"},
          {"em":"y"},
          {"span":"-axis. Researchers can also specify what increment they want for the Wet Bulb lines and the Relative Humidity curves. I also included a converter, which can take Relative Humidity data (which is what is usually collected) and convert it to Humidity Ratio data (which is the "},
          {"em":"y"},
          {"span":"-axis). Finally, I wrote a method to allow researchers to specify a shaded zone; in this way, researchers can easily specify important regions of the chart such as the thermal comfort zones. "}
        ]
      },
      {
        "p":"Since this chart uses VBA to create the graph and axillary axes, researchers can easily graph their data using the native Excel functions they are accustomed to. "
      }
    ],
    "images":[
      {
        "src":"images/excel_psych2.jpg",
        "caption":"Excel Psychrometric Chart"
      },
      {
        "src":"images/excel_psych_data.jpg",
        "caption":"Psychrometric Chart with data graphed using Excel's standard graphing functions"
      },
      {
        "src":"images/excel_psych_fill.jpg",
        "caption":"Psychrometric Chart with data and shaded comfort zone. The comfort zones are first graphed, and then converted into a shaded zone"
      },
      {
        "src":"images/excel_psych_rh.jpg",
        "caption":"Relative Humidity to Humidity Ratio converter tool"
      }
    ]
  },
  "codesam":{
    "title":"Code Samples",
    "thumb":{
      "type":"code",
      "src":"",
      "alt":"Code Samples",
      "title":"Code Samples"
    },
    "date":"Various Dates",
    "keywords":"Python, Javascript, Jquery, Arduino",
    "site":[
      {
        "title":"Github Examples",
        "src":"https://github.com/nonmetalhail"
      },
      {
        "title":"Fusion Tables Python API sample",
        "src":"https://code.google.com/p/fusion-tables-api-v1-samples/"
      },
      {
        "title":"Fusion Tables EPHT demo",
        "src":"https://code.google.com/p/oregon-epht-demo/"
      }
    ],
    "text":[
      {
        "p":"The links above are some examples of my code. These are mostly in Python, Javascript, and Arduino."
      },
      {
        "p":"My Github hosts a variety of code from classes and projects I've worked on over the past year. It includes a Search Engine I wrote in Python for an I School course, an experiment with acoustic barcodes, and Parrot AR Drone scripts that are being developed with other I School students."
      },
      {
        "p":"The other two links show code I developed while an intern at Google with the Fusion Tables team. One link is to Python code which authenticates the user with OAuth and gives them access to a variety of API methods. It also updates other code writen by the DevRel team to the v1 API."
      },
      {
        "p":"The final link is to javascript files and mock websites I made as part of my intern project. The most interesting one is a d3 slopegraph. More info on this visualization can be seen under INFO VIS/Slopegraph in this portfolio."
      }
    ],
    "images":[
      {
        "src":"images/code/barcode1.jpg",
        "caption":"Acoustic Barcodes"
      },
      {
        "src":"images/slopegraph/slopegraph.jpg",
        "caption":"The basic slopegraph, comparing Male vs Female Asthama rates in 2007"
      }
    ]
  }
}