{
  "id":"eplus",
  "title":"Energy Plus Parametric Simulation Viewer",
  "thumb":{
    "type":"info_vis",
    "src":"eplus_thumb.jpg",
    "alt":"Energy Plus Simulation Viewer",
    "title":"Energy+ Sim Viewer"
  },
  "date":"Spring 2012",
  "keywords":"Information Visualization, d3.js, Javascript, jQuery, VBA",
  "site":[
    {
      "title":"Website Viewable Here",
      "src":"http://www.nonmetalhail.com/projects/eplus/eplusViewer.html"
    }
  ],
  "text":[
    {
      "type":"text",
      "text":"In this class project for Info Vis, I created a viewer to analyze results from energy simulations I have been running as part of my Building Science Masters thesis. It uses the d3.js javascript library to compare two simulations and generates a series of small multiples bar charts. "
    },
    {
      "type":"text",
      "text":"The data shows EUI (energy by square-foot) data, broken down by end use and separated by representative cities. The cities themselves are arranged in a matrix on the page based on climate zone and climate type (see ASHRAE map). Blanks exist because there are no such climate zone-type combinations in the US."
    },
    {
      "type":"text",
      "text":"Hovering over the bars displays a pop-up showing total EUI, end use EUI,  and the percentage that end use represents."
    },
    {
      "type":"text",
      "text":"Although the graphs themselves are done, this is still a work in progress. I intend to provide key differences between the two chosen simulations which will appear as you select a simulation."
    }
  ],
  "images":[
    {
      "src":"eplus/eplus_graph.png",
      "alt":"small multiples",
      "caption":"A pair of small multiple with the on-hover feature"
    },
    {
      "src":"eplus/eplus_site.png",
      "alt":"",
      "caption":"Simulation Viewer Site"
    },
    {
      "src":"eplus/eplus_map.gif",
      "alt":"ASHRAE Climate Zone Map",
      "caption":"ASHRAE Climate Zone Map illustrating the climate zone-climate type relationship"
    }
  ]
}
