{
  "id":"psychrometric",
  "title":"Excel Psychrometric Chart",
  "thumb":{
    "type":"info_vis",
    "src":"excel_psych_thumb.jpg",
    "alt":"Excel Psychrometric Chart",
    "title":"Psychrometric Chart"
  },
  "date":"Summer 2010",
  "keywords":"VBA, Work Models",
  "text":[
    {
      "type":"text-subelem",
      "text":[
        {
          "type":"span",
          "span":"In this project, I created a "
        },
        {
          "type":"link",
          "link":{
            "src":"http://en.wikipedia.org/wiki/Psychrometrics",
            "text":"psychrometric chart "
          }
        },
        {
          "type":"span",
          "span":"in Excel. When studying the built environment, it is often useful to graph environmental data on one of these charts and contrast it to HVAC setpoints and industry defined thermal comfort zones. "
        }
      ]
    },
    {
      "type":"text",
      "text":"In my former lab, Center for the Built Environment (CBE), researchers would often plot data on psychrometric charts manually by drawing points with tools such as Adobe Illustrator or MS Powerpoint. Although software tools with psychrometric chart graphing capabilities do exist, they are tailored towards mechanical engineers and packaged with many expensive and overly complicated add-ons. What my lab needed was a cheap, straightforward, and easy to use option. "
    },
    {
      "type":"text",
      "text":"In response to this need for an intuitive and automatic psychrometric graphing tool, I decided to build one. Originally, I was going to use it as an opportunity to further my Processing skills. However, as I began to consider the problem in more depth, I realized Processing was a silly choice. In the end, I would end up with a pretty, but harder to use product&#x2014;one that interrupted the researchers' work flow. "
    },
    {
      "type":"text",
      "text":"The researchers at CBE are all well versed in Excel and use it for most of their data analysis and graphing. Rather than making the researchers export their data from Excel and into my Processing program, it made much more sense just to build a tool in Excel using VBA. This would allow for a more seamless flow from the researchers' data analysis, to visualizing their data."
    },
    {
      "type":"text-subelem",
      "text":[
        {
          "type":"span",
          "span":"The psychrometric chart allows the researcher to specify the chart ranges and increments for Temperature on the "
        },
        {
          "type":"em",
          "em":"x"
        },
        {
          "type":"span",
          "span":"-axis and Humidity Ratio on the"
        },
        {
          "type":"em",
          "em":"y"
        },
        {
          "type":"span",
          "span":"-axis. Researchers can also specify what increment they want for the Wet Bulb lines and the Relative Humidity curves. I also included a converter, which can take Relative Humidity data (which is what is usually collected) and convert it to Humidity Ratio data (which is the "
        },
        {
          "type":"em",
          "em":"y"
        },
        {
          "type":"span",
          "span":"-axis). Finally, I wrote a method to allow researchers to specify a shaded zone; in this way, researchers can easily specify important regions of the chart such as the thermal comfort zones. "
        }
      ]
    },
    {
      "type":"text",
      "text":"Since this chart uses VBA to create the graph and axillary axes, researchers can easily graph their data using the native Excel functions they are accustomed to. "
    }
  ],
  "images":[
    {
      "src":"psych/excel_psych2.jpg",
      "caption":"Excel Psychrometric Chart"
    },
    {
      "src":"psych/excel_psych_data.jpg",
      "caption":"Psychrometric Chart with data graphed using Excel's standard graphing functions"
    },
    {
      "src":"psych/excel_psych_fill.jpg",
      "caption":"Psychrometric Chart with data and shaded comfort zone. The comfort zones are first graphed, and then converted into a shaded zone"
    },
    {
      "src":"psych/excel_psych_rh.jpg",
      "caption":"Relative Humidity to Humidity Ratio converter tool"
    }
  ]
}
